Enums/упВидыТранспортныхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыТранспортныхУслуг</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаГрузов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревозкаПассажиров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиСпецтехники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацииСКонтейнерами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упПорядокИсполненияЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упПорядокИсполненияЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПутевымЛистом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейсом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыТранспортныхУслуг/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ПорядокИсполненияЗаявки = Неопределено;
	Если Параметры.Свойство("ПорядокИсполненияЗаявки", ПорядокИсполненияЗаявки) Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		Если ПорядокИсполненияЗаявки = ПредопределенноеЗначение("Перечисление.упПорядокИсполненияЗаявок.ПутевымЛистом") Тогда
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяЗаявкиНаПассажирскиеПеревозки") Тогда
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.ПеревозкаПассажиров"));	
			КонецЕсли;
			Если ПолучитьФункциональнуюОпцию("упИспользуютсяЗаявкиНаСпецтехнику") Тогда
				ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.УслугиСпецтехники"));
			КонецЕсли;
		Иначе	
			ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.упВидыТранспортныхУслуг.ПеревозкаГрузов"));		
		КонецЕсли;
		
		
	КонецЕсли;
КонецПроцедуры
